In [6]:
import numpy as np
import pandas as pd
data=pd.read_excel('water_source.xlsx')
data.head()

      source_id type_of_water_source  number_of_people_served
0  AkHa00000224          tap_in_home                      956
1  AkHa00001224   tap_in_home_broken                      930
2  AkHa00002224   tap_in_home_broken                      486
3  AkHa00003224                 well                      364
4  AkHa00004224   tap_in_home_broken                      942

In [8]:
trans=pd.read_csv('transactions.csv')
trans.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [10]:
premier_league=pd.read_excel('premier_league_games_full.xlsx')
premier_league.head()

,id,league_name,season,HomeTeam,AwayTeam,HomeGoals,AwayGoals
0,1729,England Premier League,2008/2009,Manchester United,Newcastle United,1,1
1,1730,England Premier League,2008/2009,Arsenal,West Bromwich Albion,1,0
2,1731,England Premier League,2008/2009,Sunderland,Liverpool,0,1
3,1732,England Premier League,2008/2009,West Ham United,Wigan Athletic,2,1
4,1733,England Premier League,2008/2009,Aston Villa,Manchester City,4,2

In [11]:
premier_league.tail()

,id,league_name,season,HomeTeam,AwayTeam,HomeGoals,AwayGoals
3035,4764,England Premier League,2015/2016,Southampton,Leicester City,2,2
3036,4765,England Premier League,2015/2016,Swansea City,Stoke City,0,1
3037,4766,England Premier League,2015/2016,Tottenham Hotspur,Liverpool,0,0
3038,4767,England Premier League,2015/2016,Watford,Arsenal,0,3
3039,4768,England Premier League,2015/2016,West Bromwich Albion,Sunderland,1,0

In [12]:
premier_league.sum()

id                                                       9875440
league_name    England Premier LeagueEngland Premier LeagueEn...
season         2008/20092008/20092008/20092008/20092008/20092...
HomeTeam       Manchester UnitedArsenalSunderlandWest Ham Uni...
AwayTeam       Newcastle UnitedWest Bromwich AlbionLiverpoolW...
HomeGoals                                                   4715
AwayGoals                                                   3525
dtype: object

In [13]:
premier_league.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3040 entries, 0 to 3039
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           3040 non-null   int64
 1   league_name  3040 non-null   object
 2   season       3040 non-null   object
 3   HomeTeam     3040 non-null   object
 4   AwayTeam     3040 non-null   object
 5   HomeGoals    3040 non-null   int64
 6   AwayGoals    3040 non-null   int64
dtypes: int64(3), object(4)
memory usage: 166.4+ KB

In [14]:
premier_league.shape

(3040, 7)

In [15]:
premier_league.loc[:,['HomeGoals','AwayGoals']].mean()

HomeGoals    1.550987
AwayGoals    1.159539
dtype: float64

In [16]:
premier_league.groupby('HomeTeam')